Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
#include <string.h>
#include <stdio.h>
#include "src/Hardware/board.h"
#include "src/Settings.h"
#include "GUI.h"
#include "display.h"
#include "ESP32CompositeVideo.h"
//#include "src/NFOR_SSD1306.h"
//#include "src/KT0803X.h"

#include "Player.h"

#define MENU_DEBUG(s) Serial.printf(s)

/*****************************************************************************/
/*  Menu texts                                                               */
/*****************************************************************************/

#define GUI_STRING static const char * const

#define NEW_SD_CARD "SD Card"

         // Ruler for 16 characters "1234567890123456" , "1234567890123456"; 

GUI_STRING MENU_TEXT_SOURCE0    =   "Audio Source"    ;

GUI_STRING MENU_TEXT_SSID0      =   "Select Wifi SSID";

GUI_STRING MENU_TEXT_AM_GRID0   =   "AM Spectrum"     ;
GUI_STRING MENU_TEXT_AM_GRID1[] = { "Europe,Asia,Afr." , "Australia/New Z.",
                                    "N and S America " };

GUI_STRING MENU_TEXT_FM_PGA     =   "FM Modul. Gain"  ;

GUI_STRING MENU_TEXT_OUTPUT0    =   "Output select"   ; 
GUI_STRING MENU_TEXT_OUTPUT1[]  = { "AM Only"         , "FM Only", "AM & FM", "TV Only", "AM & TV", "FM & TV", "AM & FM & TV" };

GUI_STRING MENU_TEXT_AM         =   "AM Frequency"    ;
GUI_STRING MENU_TEXT_FM         =   "FM Frequency"    ;

GUI_STRING MENU_TEXT_TIME       =   "Go to Track Time";

GUI_STRING MENU_TEXT_AM_MOD     =   "AM Mod. Depth"   ;
GUI_STRING MENU_TEXT_FM_MOD     =   "FM Mod. Mode"    ;

GUI_STRING MENU_TRIM_AM         =   "AM Depth Trim"   ;

GUI_STRING MENU_SELECT_TRACK    =   "Select Track"    ;
GUI_STRING MENU_SELECT_STATION  =   "Select Station"  ;

GUI_STRING MENU_TEXT_SETUP0       = "**** Setup **** ";
GUI_STRING MENU_TEXT_SETUP1_ENTER = "OK key to enter" ;
GUI_STRING MENU_TEXT_SETUP1_EXIT  = "OK key to exit"  ;

GUI_STRING MENU_OK_CONFIRM        = "Press OK to confirm";

GUI_STRING MENU_AM_FREQ_WAVE      = "%dkHz(%dm)";
GUI_STRING MENU_FM_FREQ_CHAN      = "%d.%dMHz(C%d%c)";

/* New for TV modulator ***************************************************/

GUI_STRING MENU_TEXT_TVCHAN0      = "TV Channel";

GUI_STRING MENU_TVMOD_SHOW_CHAN   = "%s C%d %d.%dMHz";
GUI_STRING MENU_TVMOD_EDIT_CHAN   = "C%d %d.%dMHz";

GUI_STRING MENU_TEXT_PATTERN0     = "Select Pattern";

         // Ruler for 16 characters "1234567890123456"

GUI_STRING MENU_WIFI_TX_INDEX0    = "WiFi TX Level";
GUI_STRING MENU_BT_TX_INDEX0      = "BT TX Level";

/*****************************************************************************/
/*  Playing time variables and functions                                     */
/*    - For efficient processing speed we maintain both the integer and an   */
/*      ASCII version for CurrentTrackTime                                   */
/*****************************************************************************/

static char CurrentTrackTimeString[10]; // first char holds offset

static void CurrentTrackTimeToString() {
    unsigned t = Settings.CurrentTrackTime;
    CurrentTrackTimeString[0] = 5; // index to first valid char
    CurrentTrackTimeString[9] = 0;
    CurrentTrackTimeString[8] = t % 10 + '0'; t = t / 10;
    CurrentTrackTimeString[7] = t %  6 + '0'; t = t /  6;
    CurrentTrackTimeString[6] = ':';
    CurrentTrackTimeString[5] = t % 10 + '0'; t = t / 10;
    if(t) CurrentTrackTimeString[0] = 4;
    CurrentTrackTimeString[4] = t %  6 + '0'; t = t /  6;
    CurrentTrackTimeString[3] = ':';
    if(t) CurrentTrackTimeString[0] = 2;
    CurrentTrackTimeString[2] = t % 10 + '0'; t = t / 10;
    if(t) CurrentTrackTimeString[0] = 1;
    CurrentTrackTimeString[1] = t % 10 + '0'; t = t / 10;
}
#if 0
static void PlayTimeToString(unsigned sec, char * s) {
  unsigned hrs = sec / 3600;
  sec          = sec - hrs * 3600;
  unsigned min = sec / 60;
  sec          = sec - min * 60;
  if(hrs)
    sprintf(s, "%d:%02d:%02d", (int)hrs, (int)min, (int)sec);
  else
    sprintf(s, "%d:%02d", (int)min, (int)sec);
}
#endif
/*****************************************************************************/
/*  Menu defines and variables                                               */
/*****************************************************************************/

#define MENU_DELAY_PLAYER      8  // seconds
#define MENU_DELAY_SEEK        10 // seconds

#define MENU_FUNC_INIT         0
#define MENU_FUNC_CALLBACK     1
#define MENU_FUNC_TICK         2  // Occurs every tenth of a second
//#define MENU_FUNC_SECOND       3  // Occurs every second (only for player)
#define MENU_FUNC_KEY_UP       4
#define MENU_FUNC_KEY_DN       5
#define MENU_FUNC_KEY_OK       6
#define MENU_FUNC_KEY_MENU     7
#define MENU_FUNC_EXIT         8

#define MENU_RESULT_EXIT       50
#define MENU_RESULT_SETUP      52

static int menu_delay_100ms = 0; // Menu counter for delay in tenths of a second
static int menu_edit_val    = 0; // Value will be copied to settings when confirmed

#define MENU_RESET_TIMEOUT(T) menu_delay_100ms =  (T * TIMESTAMP_RATE_100MS)

/*****************************************************************************/
/*  Some useful menu routines                                                */
/*****************************************************************************/

static void MenuValueAdjust(int adj, int min, int max, int roll) {
  if( min == max)
    menu_edit_val = min;
  else {
    menu_edit_val += adj;
    if(menu_edit_val < min) menu_edit_val = roll ? max : min;
    if(menu_edit_val > max) menu_edit_val = roll ? min : max;
  }
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
}

/*****************************************************************************/
/*  Player menu                                                              */
/*****************************************************************************/

static int MenuPlayer(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : MENU_DEBUG("MenuPlayer: INIT\n");
                              Display.PrepareMenuScreen(false);
                              break;
    case MENU_FUNC_KEY_DN   : MENU_DEBUG("MenuPlayer: KEY_DN\n");
                              return GUI_RESULT_PREV_PLAY;
    case MENU_FUNC_KEY_UP   : MENU_DEBUG("MenuPlayer: KEY_UP\n");
                              return GUI_RESULT_NEXT_PLAY;

    case MENU_FUNC_KEY_OK   : MENU_DEBUG("Menu Player: KEY_OK\n");
                              return GUI_RESULT_PAUSE_PLAY;
    case MENU_FUNC_KEY_MENU : MENU_DEBUG("MenuPlayer: KEY_MENU\n");
                              Display.PrepareMenuScreen(true);
                              return MENU_RESULT_EXIT;
                              break;
  }
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Source menu                                                              */
/*****************************************************************************/

static void MenuSourceAdjust(int adj) {
  MenuValueAdjust(adj, 0, SET_SOURCE_MAX, 1);
  Display.ShowMenuStrings(NULL, Settings.GetSourceName(menu_edit_val), NULL);
}

static int MenuSource(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.SourceAF;
                              Display.ShowMenuStrings(MENU_TEXT_SOURCE0, NULL, MENU_OK_CONFIRM);
                              MenuSourceAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuSourceAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuSourceAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NewSourceAF = menu_edit_val; 
                              return GUI_RESULT_NEW_AF_SOURCE;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select SSID                                                         */
/*****************************************************************************/

