Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
static void MenuSelectSsidAdjust(int adj) {
  if(Settings.NV.TotalSsid == 0) {
    Display.ShowMenuStrings(NULL, "No Network found", NULL);
    //Display.StartTicker("Insert SD Card with \"ssid.ini\", and restart the board.");
    MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
  }
  else {
    MenuValueAdjust(adj, 0, Settings.NV.TotalSsid - 1, 1);
    Display.ShowMenuStrings(NULL, SsidSettings.GetSsid(menu_edit_val), NULL);
  }
}

static int MenuSelectSsid(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(Settings.NV.SourceAF != SET_SOURCE_WEB_RADIO)
                                return MENU_RESULT_EXIT; // go to next menu item
                              menu_edit_val = Settings.NV.CurrentSsid;
                              Display.ShowMenuStrings(MENU_TEXT_SSID0, NULL, MENU_OK_CONFIRM);
                              MenuSelectSsidAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuSelectSsidAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuSelectSsidAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.CurrentSsid = menu_edit_val;   
                              return GUI_RESULT_NEW_SSID;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : //if(Settings.NV.SourceAF == SET_SOURCE_WEB_RADIO && Settings.NV.TotalSsid == 0)
                              //  Display.StartTicker("");
                              break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Output menu                                                              */
/*****************************************************************************/

static void MenuOutputAdjust(int adj) {
  //MenuValueAdjust(adj, 1, SET_OUTPUT_MAX, 1);

  uint8_t temp = Settings.NV.OutputSel;
  Settings.NV.OutputSel = menu_edit_val;
  Settings.AdjustOutputSelect(adj);
  menu_edit_val = Settings.NV.OutputSel;
  Settings.NV.OutputSel = temp;
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
  Display.ShowMenuStrings(NULL, MENU_TEXT_OUTPUT1[menu_edit_val-1], NULL);
}

static int MenuOutput(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(!Settings.FmPresent && !Settings.TvPresent) // AM only, skip this menu
                                return MENU_RESULT_EXIT;
                              menu_edit_val = Settings.NV.OutputSel;
                              Display.ShowMenuStrings(MENU_TEXT_OUTPUT0, NULL, MENU_OK_CONFIRM);
                              MenuOutputAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuOutputAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuOutputAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.OutputSel = menu_edit_val;
                              return GUI_RESULT_NEW_OUTPUT_SEL;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select Track/Sation                                                      */
/*****************************************************************************/

static void MenuTrackAdjust(int adj) {
  char text[32];
  uint32_t max = Settings.NV.SourceAF == SET_SOURCE_SD_CARD ? Settings.NV.DiskTotalTracks : Settings.NV.WebRadioTotalStations; 
  MenuValueAdjust(adj, 1, max, 1);
  sprintf(text,"%d/%d", menu_edit_val, max);
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuTrack(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : Serial.println("OMT Menu Track");
                              if(Settings.NV.SourceAF == SET_SOURCE_SD_CARD && Settings.NV.DiskTotalTracks > 2) {
                                menu_edit_val = Settings.NV.DiskCurrentTrack;
                                Display.ShowMenuStrings(MENU_SELECT_TRACK, NULL, MENU_OK_CONFIRM);
                              }
                              else {
                                if(Settings.NV.SourceAF == SET_SOURCE_WEB_RADIO && Settings.NV.WebRadioTotalStations > 2) {
                                  menu_edit_val = Settings.NV.WebRadioCurrentStation;
                                  Display.ShowMenuStrings(MENU_SELECT_STATION, NULL, MENU_OK_CONFIRM);
                                }
                                else
                                 return MENU_RESULT_EXIT;
                              }
                              Settings.NewTrack = 0;                              
                              MenuTrackAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuTrackAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuTrackAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NewTrack = menu_edit_val;
                              return GUI_RESULT_NEW_TRACK;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  if(Settings.NewTrack > 0)
    return GUI_RESULT_TIMEOUT;  // Terminate thisn mane as soon a new track has been chosen
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Track Time menu                                                          */
/*****************************************************************************/

static struct {
   unsigned char flag_play   : 1;
   unsigned char flag_select : 1;
   uint8_t       seconds     : 6;
   uint32_t      max_minutes;
   char          total_time[10];
} menu_time_data;

static void MenuTimeAdjust(int adj) {
  char text[32];
  if(adj != 0) {
    if(menu_time_data.seconds) {
      if(adj > 0)                                             // if(prev) round down to current minute
        MenuValueAdjust(1, 0, menu_time_data.max_minutes, 0); // else round up to next minute
      menu_time_data.seconds = 0;
    }
    else
      MenuValueAdjust(adj, 0, menu_time_data.max_minutes, 0);
  }
  sprintf(text, "%d:%02d%s", menu_edit_val, menu_time_data.seconds, menu_time_data.total_time);
  Display.ShowMenuStrings(NULL, text, NULL);
  MENU_RESET_TIMEOUT(MENU_DELAY_SEEK);
}

