Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
static int MenuTime(int function) {
  char text[24];
  static Audio * SD_Audio;
  if(menu_time_data.flag_select != 0) { // Already sought in a track?
    menu_time_data.flag_select = 0;
    return GUI_RESULT_TIMEOUT;
  }
  switch(function) {
    case MENU_FUNC_INIT     : MENU_DEBUG("MenuTime: INIT\n");
                              if(Settings.NV.SourceAF != SET_SOURCE_SD_CARD || Settings.NoCard || Settings.NV.DiskTotalTracks == 0)
                                return MENU_RESULT_EXIT; // go to next menu item

                              SD_Audio = Player.GetAudioPlayer();
                              if(SD_Audio == NULL)  
                                 return MENU_RESULT_EXIT; // go to next menu item
                              
                              menu_time_data.flag_play = SD_Audio->isRunning();
                              if(menu_time_data.flag_play) {
                                Settings.Play = 0;
                                SD_Audio->pauseResume(); // (temporally) stop playing
                              }
                              Display.ShowMenuStrings(MENU_TEXT_TIME, NULL, MENU_OK_CONFIRM);
                              Settings.CurrentTrackTime  = SD_Audio->getAudioCurrentTime();
                              Settings.TotalTrackTime    = SD_Audio->getAudioFileDuration();
                              menu_time_data.max_minutes = Settings.TotalTrackTime / 60;
                              sprintf(menu_time_data.total_time, "/%d:%02d", menu_time_data.max_minutes,  Settings.TotalTrackTime % 60);
                              menu_time_data.seconds     = Settings.CurrentTrackTime % 60; // keep seconds
                              menu_edit_val              = Settings.CurrentTrackTime / 60; // only minutes
                              menu_time_data.flag_select = 0;
                              MenuTimeAdjust(0);
                              MENU_RESET_TIMEOUT(MENU_DELAY_SEEK);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0) {
                                Settings.Play = menu_time_data.flag_play;
                                if(menu_time_data.flag_play)
                                  SD_Audio->pauseResume(); // continue playing
                                return GUI_RESULT_TIMEOUT;
                              }
                              break;
    case MENU_FUNC_KEY_UP   : MenuTimeAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuTimeAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.SeekTrackTime = menu_edit_val * 60 + menu_time_data.seconds;
                              menu_time_data.flag_select = 1;
                              Settings.Play = menu_time_data.flag_play;
                              return GUI_RESULT_SEEK_PLAY;
    case MENU_FUNC_KEY_MENU : Settings.Play = menu_time_data.flag_play;
                              if(menu_time_data.flag_play)
                                SD_Audio->pauseResume(); // continue playing
                              return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select AM grid                                                           */
/*****************************************************************************/

static void MenuSetupAmGridAdjust(int adj) {
  MenuValueAdjust(adj, 0, SET_AMGRID_MAX, 1); 
  Display.ShowMenuStrings(NULL, MENU_TEXT_AM_GRID1[menu_edit_val], NULL);
}

static int MenuSetupAmGrid(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.GridAM;
                              Display.ShowMenuStrings(MENU_TEXT_AM_GRID0, NULL, MENU_OK_CONFIRM);
                              MenuSetupAmGridAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuSetupAmGridAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuSetupAmGridAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.GridAM = menu_edit_val;   
                              Settings.NV.FreqAM = Settings.CalcNearestAmChannel(0, Settings.NV.FreqAM); 
                              return GUI_RESULT_NEW_AM_FREQ;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select FM PGA                                                            */
/*****************************************************************************/

static void MenuSetupFmPgaAdjust(int adj) {
  char text[32];

  MenuValueAdjust(adj, SET_FM_PGA_MIN, SET_FM_PGA_MAX, 1); 
  sprintf(text, "%d (%d dB)", menu_edit_val, KT0803X.PgaInDb(menu_edit_val));
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuSetupFmPga(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.FmPga;
                              Display.ShowMenuStrings(MENU_TEXT_FM_PGA, NULL, NULL);
                              MenuSetupFmPgaAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuSetupFmPgaAdjust(1);  Settings.NV.FmPga = menu_edit_val; return GUI_RESULT_NEW_FM_PGA;
    case MENU_FUNC_KEY_DN   : MenuSetupFmPgaAdjust(-1); Settings.NV.FmPga = menu_edit_val; return GUI_RESULT_NEW_FM_PGA;
    case MENU_FUNC_KEY_OK   : break;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select FM Modulation Type                                                */
/*****************************************************************************/

static void MenuSetupFmModTypeValueAdjust(int toggle) {
  Settings.NV.FmModType ^= toggle;
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
  Display.ShowMenuStrings(NULL, Settings.NV.FmModType ? "Mono" : "Stereo", NULL);
}

static int MenuSetupFmModType(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(!Settings.FmPresent || !(Settings.NV.OutputSel & SET_OUTPUT_FM_MASK))
                                return MENU_RESULT_EXIT;
                              Display.ShowMenuStrings(MENU_TEXT_FM_MOD, NULL,"");
                              MenuSetupFmModTypeValueAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : 
    case MENU_FUNC_KEY_DN   : MenuSetupFmModTypeValueAdjust(1);
                              return GUI_RESULT_NEW_FM_MOD_TYPE;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select AM Modulation Offset (trimming)                                   */
/*****************************************************************************/

static void MenuTrimAmOffsetAdjust(int adj) {
  char text[32];
  MenuValueAdjust(adj, SET_AM_MOD_TRIM_MIN, SET_AM_MOD_TRIM_MAX, 0); 
  itoa(-menu_edit_val, text, 10);
  Settings.NV.AmTrim = menu_edit_val;
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuTrimAmOffset(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.AmTrim;
                              Display.ShowMenuStrings(MENU_TRIM_AM, NULL, "");
                              MenuTrimAmOffsetAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuTrimAmOffsetAdjust(1);  return GUI_RESULT_NEW_AM_TRIM;
    case MENU_FUNC_KEY_DN   : MenuTrimAmOffsetAdjust(-1); return GUI_RESULT_NEW_AM_TRIM;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select Volume (not used)                                                 */
/*****************************************************************************/
#if 0 

static int SpeakerVolumeSelect; // 0 Volume, 1 = Balance

static void MenuSpeakerVolumeShowSelect() {
  char * s = SpeakerVolumeSelect ? MENU_TEXT_VOLUME0_BAL : MENU_TEXT_VOLUME0_AUX;
  Display_ShowMenuStrings(s, NULL, NULL);
}

