Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
static void MenuSpeakerVolumeShowLevel() {
  char text[32];
  sprintf(text, MENU_TEXT_VOLUME1_VOL, Settings.NV.VolAux1, Settings.NV.VolAux2);
  Display_ShowMenuStrings(NULL, text, NULL);
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
}

static void MenuSpeakerVolumeAdjustVal(unsigned char *val, int adj) {
  menu_edit_val = *val;
  MenuValueAdjust(adj, SET_VOLUME_MIN, SET_VOLUME_MAX, 0);
  *val = menu_edit_val;
}

static void MenuSpeakeVolumeAdjustVol(int adj) {
  unsigned char *v1,*v2;
  if(SpeakerVolumeSelect == 0) {
    if(Settings.NV.VolAux1 <= Settings.NV.VolAux2)
      { v1 = &Settings.NV.VolAux1; v2 = &Settings.NV.VolAux2; }
    else
      { v1 = &Settings.NV.VolAux2; v2 = &Settings.NV.VolAux1; }
    if(*v1 + adj < SET_VOLUME_MIN)
      { *v2 = SET_VOLUME_MIN + *v2 - *v1; *v1 = SET_VOLUME_MIN; }
    else if(*v2 + adj > SET_VOLUME_MAX)
      { *v1 = SET_VOLUME_MAX - *v2 + *v1; *v2 = SET_VOLUME_MAX; }
    else
      { *v1 += adj; *v2 += adj; }
  }
  else {
    MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux1, -adj);
    MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux2,  adj);
    // balance cannot be odd; adjust if necessary
    if(Settings.NV.VolAux1 == SET_VOLUME_MAX && Settings.NV.VolAux2 & 1)
      MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux2, -1);
    if(Settings.NV.VolAux2 == SET_VOLUME_MAX && Settings.NV.VolAux1 & 1)
      MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux1, -1);
    if(Settings.NV.VolAux1 == SET_VOLUME_MIN && Settings.NV.VolAux2 & 1)
      MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux2, 1);
    if(Settings.NV.VolAux2 == SET_VOLUME_MIN && Settings.NV.VolAux1 & 1)
      MenuSpeakerVolumeAdjustVal(&Settings.NV.VolAux1, 1);
  }
  MenuSpeakerVolumeShowLevel();
}

static int MenuVolumeControl(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(Settings.NV.OutputSel != 0) // output not to speakers?
                                return MENU_RESULT_EXIT;     // then go to next menu item
                              SpeakerVolumeSelect = 0;
                              MenuSpeakerVolumeShowSelect();
                              MenuSpeakerVolumeShowLevel();
                              TFT_ICONS(MENUFONT_MINUS,MENUFONT_PLUS,MENUFONT_BALANCE,MENUFONT_MENU);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_qs == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuSpeakeVolumeAdjustVol(4);  return MENU_RESULT_NEW_AF_VOLUME;
    case MENU_FUNC_KEY_DN   : MenuSpeakeVolumeAdjustVol(-4); return MENU_RESULT_NEW_AF_VOLUME;
    case MENU_FUNC_ENC_SW   :
    case MENU_FUNC_KEY_OK   : SpeakerVolumeSelect = !SpeakerVolumeSelect;
                              MenuSpeakerVolumeShowSelect();
                              MenuSpeakerVolumeShowLevel();
                              if(SpeakerVolumeSelect) TFT_ICONS(0,0,MENUFONT_VOLUME,0);
                              else                    TFT_ICONS(0,0,MENUFONT_BALANCE,0);
                              break;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_ENC_CCW  : MenuSpeakeVolumeAdjustVol(-1); return MENU_RESULT_NEW_AF_VOLUME;
    case MENU_FUNC_ENC_CW   : MenuSpeakeVolumeAdjustVol(1);  return MENU_RESULT_NEW_AF_VOLUME;
    case MENU_FUNC_EXIT     : AuxVolToString(); break;
  };
  return GUI_RESULT_NOP;
}
#endif
/*****************************************************************************/
/*  Select AM Modulation Level                                                */
/*****************************************************************************/

static void MenuSetupAmModLevelValueAdjust(int toggle) {
  Settings.NV.AmModLevel ^= toggle;
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
  Display.ShowMenuStrings(NULL, Settings.NV.AmModLevel ? "50%" : "100% ", NULL);
}

static int MenuSetupAmModLevel(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(!(Settings.NV.OutputSel & SET_OUTPUT_AM_MASK))
                                return MENU_RESULT_EXIT;  // AM not active
                              Display.ShowMenuStrings(MENU_TEXT_AM_MOD, NULL,"");
                              MenuSetupAmModLevelValueAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : 
    case MENU_FUNC_KEY_DN   : MenuSetupAmModLevelValueAdjust(1);
                              return GUI_RESULT_NEW_AM_DEPTH;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select AM frequency                                                      */
/*****************************************************************************/

static void MenuAmFreqAdjust(int adj) {
  char text[32];
  menu_edit_val = Settings.CalcNearestAmChannel(adj, menu_edit_val);
  MENU_RESET_TIMEOUT(MENU_DELAY_PLAYER);
  Settings.AmFreqToString(text, menu_edit_val);
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuSetupAmFreq(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.FreqAM;
                              Display.ShowMenuStrings(MENU_TEXT_AM, NULL, MENU_OK_CONFIRM);
                              MenuAmFreqAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuAmFreqAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuAmFreqAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.FreqAM = menu_edit_val;
                              return GUI_RESULT_NEW_AM_FREQ;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select FM frequency                                                      */
/*****************************************************************************/

static void MenuFmFreqAdjust(int adj) {
  char text[32];
  MenuValueAdjust(adj, SET_FM_FREQ_MIN, SET_FM_FREQ_MAX, 1);
  Settings.FmFreqToString(text, menu_edit_val);
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuSetupFmFreq(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(!Settings.FmPresent || !(Settings.NV.OutputSel & SET_OUTPUT_FM_MASK))
                                return MENU_RESULT_EXIT;
                              menu_edit_val = Settings.NV.FreqFM;
                              Display.ShowMenuStrings(MENU_TEXT_FM, NULL, MENU_OK_CONFIRM);
                              MenuFmFreqAdjust(0);
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuFmFreqAdjust(SET_FM_FREQ_STEP);  break;
    case MENU_FUNC_KEY_DN   : MenuFmFreqAdjust(-SET_FM_FREQ_STEP); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.FreqFM = menu_edit_val;
                              return GUI_RESULT_NEW_FM_FREQ;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select WIFI Maximum TX level                                             */
/*****************************************************************************/

static void MenuWifiTxLevelAdjust(int adj) {
  char s[20];
  MenuValueAdjust(adj, 0, SET_WIFI_TX_MAX, 0);
  sprintf(s,"Max pwr %s dB",Settings.GetWifiTxLevelDB(menu_edit_val));
  Display.ShowMenuStrings(NULL, s, NULL);
}

static int MenuWifiTxLevel(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : menu_edit_val = Settings.NV.WifiTxIndex;
                              Display.ShowMenuStrings(MENU_WIFI_TX_INDEX0, NULL, MENU_OK_CONFIRM);
                              MenuWifiTxLevelAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuWifiTxLevelAdjust(-1); break;
    case MENU_FUNC_KEY_DN   : MenuWifiTxLevelAdjust(1);  break;
    case MENU_FUNC_KEY_OK   : Settings.NV.WifiTxIndex = menu_edit_val;
                              return GUI_RESULT_NEW_WIFI_TX_LEVEL;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select Bluetooth Maximum TX level                                        */
/*****************************************************************************/

static void MenuBtTxLevelAdjust(int adj) {
  char s[20];
  MenuValueAdjust(adj, 0, SET_BT_TX_MAX, 0);
  // For levels see:
  // https://docs.espressif.com/projects/esp-idf/en/v4.1/api-reference/bluetooth/controller_vhci.html
  sprintf(s,"Max pwr %+d dB", menu_edit_val * 3 - 12);
  Display.ShowMenuStrings(NULL, s, NULL);
}

