Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
static int MenuBtTxLevel(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : return MENU_RESULT_EXIT;  // T.b.d.
                              menu_edit_val = Settings.NV.BtTxIndex;
                              Display.ShowMenuStrings(MENU_BT_TX_INDEX0, NULL, MENU_OK_CONFIRM);
                              MenuBtTxLevelAdjust(0);
                              break;
    case MENU_FUNC_KEY_UP   : MenuBtTxLevelAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuBtTxLevelAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.BtTxIndex = menu_edit_val;
                              return GUI_RESULT_NEW_BT_TX_LEVEL;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select TV frequency                                                      */
/*****************************************************************************/

static void MenuTvChanAdjust(int adj) {
  char text[32];
  MenuValueAdjust(adj, SET_VHF_CHAN_MIN, SET_UHF_CHAN_MAX, 1);
  if(menu_edit_val == SET_VHF_CHAN_MAX + 1) menu_edit_val = SET_UHF_CHAN_MIN;
  if(menu_edit_val == SET_UHF_CHAN_MIN - 1) menu_edit_val = SET_VHF_CHAN_MAX;
  Settings.TvChanToString(text, "", menu_edit_val);
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuTvChan(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(Settings.TvPresent && (Settings.NV.OutputSel & SET_OUTPUT_TV_MASK)) {
                                menu_edit_val = Settings.NV.TvChannel;
                                Display.ShowMenuStrings(MENU_TEXT_TVCHAN0, NULL, MENU_OK_CONFIRM);
                                MenuTvChanAdjust(0);
                              }
                              else
                                return MENU_RESULT_EXIT;
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuTvChanAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuTvChanAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.TvChannel = menu_edit_val;
                              return GUI_RESULT_NEW_TV_CHANNEL;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Select Video Image (needs optimal video module)                          */
/*****************************************************************************/

static void MenuPatternAdjust(int adj) {
  char text[32];
  if(ESP32CompositeVideo.ImageCount() != 0) {
    MenuValueAdjust(adj, 0, ESP32CompositeVideo.ImageCount()-1, 1);
    sprintf(text, "Image %d", menu_edit_val + 1);
  }
  else {
    menu_edit_val = 0;
    strcpy(text, "No images");
  }
  Display.ShowMenuStrings(NULL, text, NULL);
}

static int MenuPattern(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : if(Settings.VidPresent && (Settings.NV.OutputSel & SET_OUTPUT_TV_MASK)) {
                                menu_edit_val = Settings.NV.VidImage;
                                Display.ShowMenuStrings(MENU_TEXT_PATTERN0, NULL, MENU_OK_CONFIRM);
                                MenuPatternAdjust(0);
                              }
                              else
                                return MENU_RESULT_EXIT;
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_UP   : MenuPatternAdjust(1);  break;
    case MENU_FUNC_KEY_DN   : MenuPatternAdjust(-1); break;
    case MENU_FUNC_KEY_OK   : Settings.NV.VidImage = menu_edit_val;
                              return GUI_RESULT_NEW_VID_IMAGE;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
    case MENU_FUNC_EXIT     : break;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Enter/Exit setup menu                                                    */
/*****************************************************************************/

static int MenuEnterSetup(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : Display.ShowMenuStrings(MENU_TEXT_SETUP0, MENU_TEXT_SETUP1_ENTER, "");
                              break;
    case MENU_FUNC_TICK     : if(--menu_delay_100ms == 0)
                                return GUI_RESULT_TIMEOUT;
                              break;
    case MENU_FUNC_KEY_OK   : return MENU_RESULT_SETUP;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
  };
  return GUI_RESULT_NOP;
}

static int MenuExitSetup(int function) {
  switch(function) {
    case MENU_FUNC_INIT     : Display.ShowMenuStrings(MENU_TEXT_SETUP0, MENU_TEXT_SETUP1_EXIT, "");
                              break;
    case MENU_FUNC_KEY_OK   : return MENU_RESULT_SETUP;
    case MENU_FUNC_KEY_MENU : return MENU_RESULT_EXIT;
  };
  return GUI_RESULT_NOP;
}

/*****************************************************************************/
/*  Menu function selector                                                   */
/*****************************************************************************/

static int current_menu;

typedef struct {
  int (* f)(int);
  int next;
  int next_alt;
  int use_timeout;
} MenuType;

#define MENU_INDEX_PLAYER          0
#define MENU_INDEX_TIME            1
#define MENU_INDEX_TRACK           2
#define MENU_INDEX_SSID            3
#define MENU_INDEX_SOURCE          4
#define MENU_INDEX_OUTPUT          5
#define MENU_INDEX_SETUP_FM_FREQ   6
#define MENU_INDEX_SETUP_FM_MOD    7
#define MENU_INDEX_SETUP_AM_LVL    8
#define MENU_INDEX_SETUP_TV_CHAN   9
#define MENU_INDEX_SETUP_PATTERN   10
#define MENU_INDEX_ENTER_SETUP     11
#define MENU_INDEX_SETUP_AM_FREQ   12
#define MENU_INDEX_TRIM_AM_OFFSET  13
#define MENU_INDEX_SETUP_AM_GRID   14
#define MENU_INDEX_SETUP_FM_PGA    15
#define MENU_INDEX_SETUP_TX_LEVEL1 16
#define MENU_INDEX_SETUP_TX_LEVEL2 17
#define MENU_INDEX_EXIT_SETUP      18
#define MENU_INDEX_COUNT           19

#define MENU_INDEX_DEFAULT         MENU_INDEX_PLAYER

static MenuType MenuEntries[MENU_INDEX_COUNT] = {
  { MenuPlayer,          MENU_INDEX_TIME,            0,0 },
  { MenuTime,            MENU_INDEX_TRACK,           0,1 },
  { MenuTrack,           MENU_INDEX_SSID,            0,1 },
  { MenuSelectSsid,      MENU_INDEX_SOURCE,          0,1 },
  { MenuSource,          MENU_INDEX_OUTPUT,          0,1 },
  { MenuOutput,          MENU_INDEX_SETUP_FM_FREQ,   0,1 },
  { MenuSetupFmFreq,     MENU_INDEX_SETUP_FM_MOD,    0,1 },
  { MenuSetupFmModType,  MENU_INDEX_SETUP_AM_LVL,    0,1 },
  { MenuSetupAmModLevel, MENU_INDEX_SETUP_TV_CHAN,   0,1 },
  { MenuTvChan,          MENU_INDEX_SETUP_PATTERN,   0,1 },
  { MenuPattern,         MENU_INDEX_ENTER_SETUP,     0,1 },
  { MenuEnterSetup,      MENU_INDEX_DEFAULT,         MENU_INDEX_SETUP_AM_FREQ, 1 },
  { MenuSetupAmFreq,     MENU_INDEX_TRIM_AM_OFFSET,  0,0 },
  { MenuTrimAmOffset,    MENU_INDEX_SETUP_AM_GRID,   0,0 },
  { MenuSetupAmGrid,     MENU_INDEX_SETUP_FM_PGA,    0,0 },
  { MenuSetupFmPga,      MENU_INDEX_SETUP_TX_LEVEL1, 0,0 },
  { MenuWifiTxLevel,     MENU_INDEX_SETUP_TX_LEVEL2, 0,0 },
  { MenuBtTxLevel,       MENU_INDEX_EXIT_SETUP,      0,0 },
  { MenuExitSetup,       MENU_INDEX_SETUP_AM_FREQ,   MENU_INDEX_DEFAULT, 0 }
};

#define MenuFunction(func) MenuEntries[current_menu].f(func)

/*****************************************************************************/
/*  GUI: Init                                                                */
/*****************************************************************************/

void GuiInit() {
  // Init some strings
  CurrentTrackTimeToString();

