Gloeidraad/AMFM-modulator-with-ESP32-module/software/ESP32-AM-FM-Modulator/GUI.cpp
  menu_time_data.flag_select = 0;
  // Init menu
  current_menu = MENU_INDEX_PLAYER;
  MenuFunction(MENU_FUNC_INIT);
}

/*****************************************************************************/
/* GUI: Main routine (called every 20.8 to 125 microseconds)                 */
/*****************************************************************************/

int GuiCallback(int key_press) {
  static uint8_t  key               = 0xff;
  static uint64_t timestamp_us_prev = 0;
  int result                        = GUI_RESULT_NOP;
  uint64_t timestamp_us             = esp_timer_get_time();
 
  if(key_press != 0xff)
    key = key_press;  // Remember the key to next time slot

  // Use own local time stamp. (The main time stamp does not work properly here,
  // since it falls behind the real stamp when playing track which loads the
  // processor heavily. As soon as playing is interrupted, you get all the
  // delayed ticks immediately. Causing the menu to malfunction).
  if(timestamp_us - timestamp_us_prev >= TIMESTAMP_100MS_DIV) { 
    timestamp_us_prev = timestamp_us;
    result = MenuFunction(MENU_FUNC_TICK); // 100ms second time slices
  }
  else
   return GUI_RESULT_NOP;

  if(result == GUI_RESULT_NOP) {
    if(key != 0xff) {
      switch(key) {
        case KEY_SPARE : break;
        case KEY_DN    : result = MenuFunction(MENU_FUNC_KEY_DN); break;
        case KEY_UP    : result = MenuFunction(MENU_FUNC_KEY_UP); break;
        case KEY_OK    : result = MenuFunction(MENU_FUNC_KEY_OK); break;
        case KEY_MENU  : result = MenuFunction(MENU_FUNC_KEY_MENU); break;
      }
      key = 0xff;
    }
  }
  do {
    switch(result) {
      case MENU_RESULT_SETUP:     MenuFunction(MENU_FUNC_EXIT);
                                  current_menu = MenuEntries[current_menu].next_alt;
                                  MenuFunction(MENU_FUNC_INIT);
                                  break;
      case MENU_RESULT_EXIT:      MenuFunction(MENU_FUNC_EXIT);
                                  Settings.EepromStore();
                                  current_menu = MenuEntries[current_menu].next;
                                  result = MenuFunction(MENU_FUNC_INIT);
                                  break;
      case GUI_RESULT_TIMEOUT:    MenuFunction(MENU_FUNC_EXIT);
                                  Settings.EepromStore();
                                  current_menu = MENU_INDEX_DEFAULT;
                                  MenuFunction(MENU_FUNC_INIT);
                                  break;
    }
  } while(result == MENU_RESULT_EXIT);
  return result;
}
